outline.org
* Ready, Set, Clojure!
** Introduction
*** Why Clojure?
*** What are we going to cover?
**** Some of the Clojure basics
**** Clojure's built in test framework (clojure.test)
**** Java interop
**** Polymorphism
**** Macros
**** Contrib libraries
**** Leiningen
*** Surely a Clojure adapter for Redis already exists!
**** List current implementations
** Getting Started
*** A little housekeeping
**** Bootstrapping the environment
#+begin_src sh
  $ lein new yow
  $ cd yow
  $ mkdir script
  $ touch script/bootstrap
  $ chmod +x script/bootstrap
#+end_src

#+begin_src sh
  REDIS_VERSION=2.6.4
  URL=http://redis.googlecode.com/files/$REDIS_VERSION.tar.gz
  
  if [ ! -d "vendor" ]; then
      mkdir vendor
      pushd vendor
      if which wget > /dev/null; then
          wget $URL
      else
          curl -O $URL
      fi
      tar xvf $REDIS_VERSION.tar.gz
      pushd $REDIS_VERSION
      make
      popd
      popd
  fi
#+end_src

#+begin_src sh
  if [ ! -d "config" ]; then
      mkdir config
      cp vendor/$REDIS_VERSION/redis.conf config/
  fi
  
  if [ ! -d "bin" ]; then
      mkdir bin
      cp vendor/$REDIS_VERSION/src/redis-server bin/
      cp vendor/$REDIS_VERSION/src/redis-cli bin/
  fi
#+end_src

#+begin_src fundamental
  $ tree
  |-- README.md
  |-- bin
  |   |-- redis-cli
  |   `-- redis-server
  |-- config
  |   `-- redis.conf
  |-- project.clj
  |-- script
  |   |-- bootstrap
  |-- src
  |   `-- yow
  |       `-- core.clj
  |-- test
  |   `-- yow
  |       `-- core_test.clj
  `-- vendor
      `-- redis-2.6.4
#+end_src

**** What you will need
**** Explain the unified protocol
*** An introduction to clojure.test
#+begin_src clojure
  (defn hello
    [name]
    (str "Hello " name "!"))
  
  (deftest test-hello
    (is (= "Hello Yow!" (hello "Yow"))))
#+end_src
*** Turning the example from the docs into a test
#+begin_src clojure
  (deftest test-command
    (testing "Produces a well formed command string"
      (is (= "*3\r\n$3\r\nSET\r\n$5\r\nmykey\r\n$7\r\nmyvalue\r\n"
             (command "set" "mykey" "myvalue")))))
#+end_src
*** Implementation
#+begin_src clojure
  (def crlf "\r\n")
  
  (defn command
    [name & args]
    (str "*"
         (inc (count args)) crlf
         "$" (count name) crlf
         (str/upper-case name) crlf
         (str/join crlf
                   (map (fn [x] (str "$" (count x) crlf x)) args))
         crlf))
#+end_src

#+begin_src fundamental
  Testing yow.core-test
  
  Ran 1 tests containing 1 assertions.
  0 failures, 0 errors.
#+end_src
** Hello Redis!
*** A brief explanation of Java interop in Clojure
#+begin_src clojure
  user> (import '(java.net Socket))
  ;-> java.net.Socket
  user> (Socket.)
  ;-> #<Socket Socket[unconnected]>
  user> (Socket. "localhost" 6379)
  ;-> #<Socket Socket[addr=localhost/127.0.0.1,port=6379,localport=45284]>
  user> (def s (Socket. "localhost" 6379))
  ;-> #'user/s
  user> (.setKeepAlive s true)
  ;-> nil
  user> (.getKeepAlive s)
  ;-> true
#+end_src
