outline.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>outline</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="outline"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-23 16:17:06 CST"/>
<meta name="author" content="Aaron Bedra"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">outline</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Ready, Set, Clojure!</a>
<ul>
<li><a href="#sec-1-1">1.1 Introduction</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Why Clojure?</a></li>
<li><a href="#sec-1-1-2">1.1.2 What are we going to cover?</a></li>
<li><a href="#sec-1-1-3">1.1.3 Surely a Clojure adapter for Redis already exists!</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Getting Started</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 A little housekeeping</a></li>
<li><a href="#sec-1-2-2">1.2.2 An introduction to clojure.test</a></li>
<li><a href="#sec-1-2-3">1.2.3 Turning the example from the docs into a test</a></li>
<li><a href="#sec-1-2-4">1.2.4 Implementation</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 Hello Redis!</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 A brief explanation of Java interop in Clojure</a></li>
<li><a href="#sec-1-3-2">1.3.2 Using the Java socket API and the protocol implementation to communicate with Redis</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 Speaking the same language</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 We can write to Redis, but we aren't able to understand the response yet</a></li>
<li><a href="#sec-1-4-2">1.4.2 Runtime Polymorphism in Clojure</a></li>
<li><a href="#sec-1-4-3">1.4.3 An introduction to multimethods</a></li>
<li><a href="#sec-1-4-4">1.4.4 Reading the response</a></li>
<li><a href="#sec-1-4-5">1.4.5 Validating our assumptions with a few more tests</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 A mountain to climb</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 Exploring the Redis commands</a></li>
<li><a href="#sec-1-5-2">1.5.2 There are 144 commands in Redis 2.6.4</a></li>
<li><a href="#sec-1-5-3">1.5.3 There are only a handful of ideas behind all of them</a></li>
<li><a href="#sec-1-5-4">1.5.4 Do we write and maintain 144 functions?</a></li>
<li><a href="#sec-1-5-5">1.5.5 An introduction to macros in Clojure</a></li>
<li><a href="#sec-1-5-6">1.5.6 Defining a language for describing command functions</a></li>
<li><a href="#sec-1-5-7">1.5.7 Writing the macros that pull it all together</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 Keeping track of the commands</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 How do we keep track of everything?</a></li>
<li><a href="#sec-1-6-2">1.6.2 Programatically extracting all of the commands</a></li>
<li><a href="#sec-1-6-3">1.6.3 Writing the commands file</a></li>
<li><a href="#sec-1-6-4">1.6.4 Not all commands created equal</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 Wrapping up</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 Packaging and distribution</a></li>
<li><a href="#sec-1-7-2">1.7.2 Recap on what we built</a></li>
<li><a href="#sec-1-7-3">1.7.3 Where to go from here</a></li>
<li><a href="#sec-1-7-4">1.7.4 References</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ready, Set, Clojure!</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Why Clojure?</h4>
<div class="outline-text-4" id="text-1-1-1">

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> What are we going to cover?</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li id="sec-1-1-2-1">Some of the Clojure basics<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-2">Clojure's built in test framework (clojure.test)<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-3">Java interop<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-4">Polymorphism<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-5">Macros<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-6">Contrib libraries<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-7">Leiningen<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Surely a Clojure adapter for Redis already exists!</h4>
<div class="outline-text-4" id="text-1-1-3">

<ul>
<li id="sec-1-1-3-1">List current implementations<br/>
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Getting Started</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> A little housekeeping</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li id="sec-1-2-1-1">Bootstrapping the environment<br/>



<pre class="src src-sh">$ lein new yow
$ cd yow
$ mkdir script
$ touch script/bootstrap
$ chmod +x script/bootstrap
</pre>



<pre class="src src-sh"><span style="color: #a0522d;">REDIS_VERSION</span>=2.6.4
<span style="color: #a0522d;">URL</span>=http://redis.googlecode.com/files/$<span style="color: #a0522d;">REDIS_VERSION</span>.tar.gz

<span style="color: #a020f0;">if</span> [ ! -d <span style="color: #8b2252;">"vendor"</span> ]; <span style="color: #a020f0;">then</span>
    mkdir vendor
    <span style="color: #483d8b;">pushd</span> vendor
    <span style="color: #a020f0;">if </span><span style="color: #483d8b;">which</span> wget &gt; /dev/null; <span style="color: #a020f0;">then</span>
        wget $<span style="color: #a0522d;">URL</span>
    <span style="color: #a020f0;">else</span>
        curl -O $<span style="color: #a0522d;">URL</span>
    <span style="color: #a020f0;">fi</span>
    tar xvf $<span style="color: #a0522d;">REDIS_VERSION</span>.tar.gz
    <span style="color: #483d8b;">pushd</span> $<span style="color: #a0522d;">REDIS_VERSION</span>
    make
    <span style="color: #483d8b;">popd</span>
    <span style="color: #483d8b;">popd</span>
<span style="color: #a020f0;">fi</span>
</pre>



<pre class="src src-sh"><span style="color: #a020f0;">if</span> [ ! -d <span style="color: #8b2252;">"config"</span> ]; <span style="color: #a020f0;">then</span>
    mkdir config
    cp vendor/$<span style="color: #a0522d;">REDIS_VERSION</span>/redis.conf config/
<span style="color: #a020f0;">fi</span>

<span style="color: #a020f0;">if</span> [ ! -d <span style="color: #8b2252;">"bin"</span> ]; <span style="color: #a020f0;">then</span>
    mkdir bin
    cp vendor/$<span style="color: #a0522d;">REDIS_VERSION</span>/src/redis-server bin/
    cp vendor/$<span style="color: #a0522d;">REDIS_VERSION</span>/src/redis-cli bin/
<span style="color: #a020f0;">fi</span>
</pre>



<pre class="src src-fundamental">$ tree
|-- README.md
|-- bin
|   |-- redis-cli
|   `-- redis-server
|-- config
|   `-- redis.conf
|-- project.clj
|-- script
|   |-- bootstrap
|-- src
|   `-- yow
|       `-- core.clj
|-- test
|   `-- yow
|       `-- core_test.clj
`-- vendor
    `-- redis-2.6.4
</pre>


</li>
</ul>
<ul>
<li id="sec-1-2-1-2">What you will need<br/>
</li>
</ul>
<ul>
<li id="sec-1-2-1-3">Explain the unified protocol<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> An introduction to clojure.test</h4>
<div class="outline-text-4" id="text-1-2-2">




<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">hello</span>
  [name]
  (<span style="color: #a0522d;">str</span> <span style="color: #8b2252;">"Hello "</span> name <span style="color: #8b2252;">"!"</span>))

(<span style="color: #a020f0;">deftest</span> <span style="color: #0000ff;">test-hello</span>
  (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"Hello Yow!"</span> (hello <span style="color: #8b2252;">"Yow"</span>))))
</pre>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Turning the example from the docs into a test</h4>
<div class="outline-text-4" id="text-1-2-3">




<pre class="src src-clojure">(<span style="color: #a020f0;">deftest</span> <span style="color: #0000ff;">test-command</span>
  (<span style="color: #228b22;">testing</span> <span style="color: #8b2252;">"Produces a well formed command string"</span>
    (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"*3\r\n$3\r\nSET\r\n$5\r\nmykey\r\n$7\r\nmyvalue\r\n"</span>
           (command <span style="color: #8b2252;">"set"</span> <span style="color: #8b2252;">"mykey"</span> <span style="color: #8b2252;">"myvalue"</span>)))))
</pre>

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Implementation</h4>
<div class="outline-text-4" id="text-1-2-4">




<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">crlf</span> <span style="color: #8b2252;">"\r\n"</span>)

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">command</span>
  [name &amp; args]
  (<span style="color: #a0522d;">str</span> <span style="color: #8b2252;">"*"</span>
       (<span style="color: #a0522d;">inc</span> (<span style="color: #a0522d;">count</span> args)) crlf
       <span style="color: #8b2252;">"$"</span> (<span style="color: #a0522d;">count</span> name) crlf
       (str/upper-case name) crlf
       (str/<span style="color: #228b22;">join</span> crlf
                 (<span style="color: #a0522d;">map</span> (<span style="color: #a020f0;">fn</span> [x] (<span style="color: #a0522d;">str</span> <span style="color: #8b2252;">"$"</span> (<span style="color: #a0522d;">count</span> x) crlf x)) args))
       crlf))
</pre>



<pre class="src src-fundamental">Testing yow.core-test

Ran 1 tests containing 1 assertions.
0 failures, 0 errors.
</pre>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Hello Redis!</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> A brief explanation of Java interop in Clojure</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-clojure">user&gt; (<span style="color: #483d8b;">import</span> '(java.net <span style="color: #483d8b;">Socket</span>))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; java.net.Socket</span>
user&gt; (<span style="color: #483d8b;">Socket.</span>)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; #&lt;Socket Socket[unconnected]&gt;</span>
user&gt; (<span style="color: #483d8b;">Socket.</span> <span style="color: #8b2252;">"localhost"</span> 6379)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; #&lt;Socket Socket[addr=localhost/127.0.0.1,port=6379,localport=45284]&gt;</span>
user&gt; (<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">s</span> (<span style="color: #483d8b;">Socket.</span> <span style="color: #8b2252;">"localhost"</span> 6379))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; #'user/s</span>
user&gt; (<span style="color: #483d8b;">.setKeepAlive</span> s true)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; nil</span>
user&gt; (<span style="color: #483d8b;">.getKeepAlive</span> s)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; true</span>
</pre>

</div>

</div>
