outline.org
*** Using the Java socket API and the protocol implementation to communicate with Redis
#+begin_src clojure
  (defn- socket
    []
    (doto (Socket. "localhost" 6379)
      (.setTcpNoDelay true)
      (.setKeepAlive true)))
#+end_src

#+begin_src clojure
  (defn request
    [query]
    (with-open [socket (socket)
                in (DataInputStream.
                    (BufferedInputStream.
                     (.getInputStream socket)))
                out (.getOutputStream socket)]
      (.write out (.getBytes (apply str query)))
      (println in)))
#+end_src

#+begin_src clojure
  user> (request (command "set" "foo" "bar"))
  ;-> #<DataInputStream java.io.DataInputStream@580a00fd>
#+end_src

#+begin_src sh
  $ bin/redis-cli get foo
  "bar"
#+end_src
** Speaking the same language
*** We can write to Redis, but we aren't able to understand the response yet
*** Runtime Polymorphism in Clojure
**** 3 Levels of Support
***** Most of the core datastructures are implemented using Java interfaces
***** Supports generation of interfaces via proxy
***** Multimethods (arbitrary dispatch)
*** An introduction to multimethods
#+begin_src clojure
  (defmulti encounter
    (fn [x y]
      [(:Species x) (:Species y)]))
  
  (defmethod encounter [:Bunny :Lion] [b l]  :run-away)
  (defmethod encounter [:Lion :Bunny] [b l]  :eat)
  (defmethod encounter [:Lion :Lion] [b l]   :fight)
  (defmethod encounter [:Bunny :Bunny] [b l] :mate)
#+end_src

#+begin_src clojure
  (def b1 {:Species :Bunny :other :stuff})
  (def b2 {:Species :Bunny :other :stuff})
  (def l1 {:Species :Lion :other :stuff})
  (def l2 {:Species :Lion :other :stuff})
  
  (encounter b1 b2)
  ;-> :mate
  (encounter b1 l1)
  ;-> :run-away
  (encounter l1 b1)
  ;-> :eat
  (encounter l1 l2)
  ;-> :fight
#+end_src
*** Reading the response
**** The Rules
#+begin_src fundamental
  Redis will reply to commands with different kinds of replies. It is
  possible to check the kind of reply from the first byte sent by the
  server:
  
  With a single line reply the first byte of the reply will be "+"
  With an error message the first byte of the reply will be    "-"
  With an integer number the first byte of the reply will be   ":"
  With bulk reply the first byte of the reply will be          "$"
  With multi-bulk reply the first byte of the reply will be    "*"
#+end_src
**** Defining our response multimethod
#+begin_src clojure
  (defmulti response
    (fn [in] (char (.readByte in))))
  
  (defmethod response \- [in]
    (.readLine in))
  
  (defmethod response \+ [in]
    (.readLine in))
  
  (defmethod response \: [in]
    (Long/parseLong (.readLine in)))
  
  (defmethod response \$ [in]
    (.readLine in)
    (.readLine in))
  
  (defmethod response \* [in]
    (throw (UnsupportedOperationException. "Not Yet Implemented")))
#+end_src

#+begin_src clojure
  user> (request (command "set" "foo" "bar"))
  ;-> "OK"
  
  user> (request (command "get" "foo"))
  ;-> "bar"
#+end_src
*** Validating our assumptions with a few more tests
#+begin_src clojure
  ;; Examples taken from http://try.redis-db.com/
  (deftest test-basic-interaction
    (testing "SET then GET"
      (is (= "OK" (request (command "set" "server:name" "fido"))))
      (is (= "fido" (request (command "get" "server:name")))))
    (testing "INCR"
      (request (command "set" "connections" "10"))
      (is (= 11 (request (command "incr" "connections")))))
    (testing "DEL"
      (is (= 1 (request (command "del" "connections"))))))
#+end_src

#+begin_src fundamental
  Testing yow.core-test
  
  Ran 2 tests containing 5 assertions.
  0 failures, 0 errors.
#+end_src

** A mountain to climb
