outline.html

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Using the Java socket API and the protocol implementation to communicate with Redis</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="src src-clojure">(<span style="color: #a020f0;">defn-</span> <span style="color: #0000ff;">socket</span>
  []
  (<span style="color: #483d8b;">doto</span> (<span style="color: #483d8b;">Socket.</span> <span style="color: #8b2252;">"localhost"</span> 6379)
    (<span style="color: #483d8b;">.setTcpNoDelay</span> true)
    (<span style="color: #483d8b;">.setKeepAlive</span> true)))
</pre>



<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">request</span>
  [query]
  (<span style="color: #483d8b;">with-open</span> [socket (socket)
              in (<span style="color: #483d8b;">DataInputStream.</span>
                  (<span style="color: #483d8b;">BufferedInputStream.</span>
                   (<span style="color: #483d8b;">.getInputStream</span> socket)))
              out (<span style="color: #483d8b;">.getOutputStream</span> socket)]
    (<span style="color: #483d8b;">.write</span> out (<span style="color: #483d8b;">.getBytes</span> (<span style="color: #a0522d;">apply</span> str query)))
    (<span style="color: #a0522d;">println</span> in)))
</pre>



<pre class="src src-clojure">user&gt; (request (command <span style="color: #8b2252;">"set"</span> <span style="color: #8b2252;">"foo"</span> <span style="color: #8b2252;">"bar"</span>))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; #&lt;DataInputStream java.io.DataInputStream@580a00fd&gt;</span>
</pre>



<pre class="src src-sh">$ bin/redis-cli get foo
<span style="color: #8b2252;">"bar"</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Speaking the same language</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> We can write to Redis, but we aren't able to understand the response yet</h4>
<div class="outline-text-4" id="text-1-4-1">

</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> Runtime Polymorphism in Clojure</h4>
<div class="outline-text-4" id="text-1-4-2">

<ul>
<li id="sec-1-4-2-1">3 Levels of Support<br/>
<ul>
<li id="sec-1-4-2-1-1">Most of the core datastructures are implemented using Java interfaces<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-2-1-2">Supports generation of interfaces via proxy<br/>
</li>
</ul>
<ul>
<li id="sec-1-4-2-1-3">Multimethods (arbitrary dispatch)<br/>
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> An introduction to multimethods</h4>
<div class="outline-text-4" id="text-1-4-3">




<pre class="src src-clojure">(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">encounter</span>
  (<span style="color: #a020f0;">fn</span> [x y]
    [(<span style="color: #008b8b;">:Species</span> x) (<span style="color: #008b8b;">:Species</span> y)]))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">encounter</span> [<span style="color: #008b8b;">:Bunny</span> <span style="color: #008b8b;">:Lion</span>] [b l]  <span style="color: #008b8b;">:run-away</span>)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">encounter</span> [<span style="color: #008b8b;">:Lion</span> <span style="color: #008b8b;">:Bunny</span>] [b l]  <span style="color: #008b8b;">:eat</span>)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">encounter</span> [<span style="color: #008b8b;">:Lion</span> <span style="color: #008b8b;">:Lion</span>] [b l]   <span style="color: #008b8b;">:fight</span>)
(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">encounter</span> [<span style="color: #008b8b;">:Bunny</span> <span style="color: #008b8b;">:Bunny</span>] [b l] <span style="color: #008b8b;">:mate</span>)
</pre>



<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">b1</span> {<span style="color: #008b8b;">:Species</span> <span style="color: #008b8b;">:Bunny</span> <span style="color: #008b8b;">:other</span> <span style="color: #008b8b;">:stuff</span>})
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">b2</span> {<span style="color: #008b8b;">:Species</span> <span style="color: #008b8b;">:Bunny</span> <span style="color: #008b8b;">:other</span> <span style="color: #008b8b;">:stuff</span>})
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">l1</span> {<span style="color: #008b8b;">:Species</span> <span style="color: #008b8b;">:Lion</span> <span style="color: #008b8b;">:other</span> <span style="color: #008b8b;">:stuff</span>})
(<span style="color: #a020f0;">def</span> <span style="color: #0000ff;">l2</span> {<span style="color: #008b8b;">:Species</span> <span style="color: #008b8b;">:Lion</span> <span style="color: #008b8b;">:other</span> <span style="color: #008b8b;">:stuff</span>})

(encounter b1 b2)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; :mate</span>
(encounter b1 l1)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; :run-away</span>
(encounter l1 b1)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; :eat</span>
(encounter l1 l2)
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; :fight</span>
</pre>

</div>

</div>

<div id="outline-container-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> Reading the response</h4>
<div class="outline-text-4" id="text-1-4-4">

<ul>
<li id="sec-1-4-4-1">The Rules<br/>



<pre class="src src-fundamental">Redis will reply to commands with different kinds of replies. It is
possible to check the kind of reply from the first byte sent by the
server:

With a single line reply the first byte of the reply will be <span style="color: #8b2252;">"+"</span>
With an error message the first byte of the reply will be    <span style="color: #8b2252;">"-"</span>
With an integer number the first byte of the reply will be   <span style="color: #8b2252;">":"</span>
With bulk reply the first byte of the reply will be          <span style="color: #8b2252;">"$"</span>
With multi-bulk reply the first byte of the reply will be    <span style="color: #8b2252;">"*"</span>
</pre>

</li>
</ul>
<ul>
<li id="sec-1-4-4-2">Defining our response multimethod<br/>



<pre class="src src-clojure">(<span style="color: #a020f0;">defmulti</span> <span style="color: #0000ff;">response</span>
  (<span style="color: #a020f0;">fn</span> [in] (<span style="color: #a0522d;">char</span> (<span style="color: #483d8b;">.readByte</span> in))))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">response</span> \- [in]
  (<span style="color: #483d8b;">.readLine</span> in))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">response</span> \+ [in]
  (<span style="color: #483d8b;">.readLine</span> in))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">response</span> \: [in]
  (<span style="color: #483d8b;">Long/parseLong</span> (<span style="color: #483d8b;">.readLine</span> in)))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">response</span> \$ [in]
  (<span style="color: #483d8b;">.readLine</span> in)
  (<span style="color: #483d8b;">.readLine</span> in))

(<span style="color: #a020f0;">defmethod</span> <span style="color: #0000ff;">response</span> \* [in]
  (<span style="color: #483d8b;">throw</span> (<span style="color: #483d8b;">UnsupportedOperationException.</span> <span style="color: #8b2252;">"Not Yet Implemented"</span>)))
</pre>



<pre class="src src-clojure">user&gt; (request (command <span style="color: #8b2252;">"set"</span> <span style="color: #8b2252;">"foo"</span> <span style="color: #8b2252;">"bar"</span>))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; "OK"</span>

user&gt; (request (command <span style="color: #8b2252;">"get"</span> <span style="color: #8b2252;">"foo"</span>))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; "bar"</span>
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> Validating our assumptions with a few more tests</h4>
<div class="outline-text-4" id="text-1-4-5">




<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">Examples taken from http://try.redis-db.com/</span>
(<span style="color: #a020f0;">deftest</span> <span style="color: #0000ff;">test-basic-interaction</span>
  (<span style="color: #228b22;">testing</span> <span style="color: #8b2252;">"SET then GET"</span>
    (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"OK"</span> (request (command <span style="color: #8b2252;">"set"</span> <span style="color: #8b2252;">"server:name"</span> <span style="color: #8b2252;">"fido"</span>))))
    (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> <span style="color: #8b2252;">"fido"</span> (request (command <span style="color: #8b2252;">"get"</span> <span style="color: #8b2252;">"server:name"</span>)))))
  (<span style="color: #228b22;">testing</span> <span style="color: #8b2252;">"INCR"</span>
    (request (command <span style="color: #8b2252;">"set"</span> <span style="color: #8b2252;">"connections"</span> <span style="color: #8b2252;">"10"</span>))
    (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> 11 (request (command <span style="color: #8b2252;">"incr"</span> <span style="color: #8b2252;">"connections"</span>)))))
  (<span style="color: #228b22;">testing</span> <span style="color: #8b2252;">"DEL"</span>
    (<span style="color: #228b22;">is</span> (<span style="color: #a0522d;">=</span> 1 (request (command <span style="color: #8b2252;">"del"</span> <span style="color: #8b2252;">"connections"</span>))))))
</pre>



<pre class="src src-fundamental">Testing yow.core-test

Ran 2 tests containing 5 assertions.
0 failures, 0 errors.
</pre>


</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> A mountain to climb</h3>
<div class="outline-text-3" id="text-1-5">


</div>
