outline.html

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Exploring the Redis commands</h4>
<div class="outline-text-4" id="text-1-5-1">




<pre class="src src-clojure">(<span style="color: #483d8b;">ns</span> yow.commands
  (<span style="color: #008b8b;">:use</span> [clojure.data.json <span style="color: #008b8b;">:only</span> (read-str)]))

(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">fetch-redis-commands</span>
  []
  (<span style="color: #a0522d;">map</span> first
   (read-str
    (<span style="color: #a0522d;">slurp</span> <span style="color: #8b2252;">"https://raw.github.com/antirez/redis-doc/master/commands.json"</span>))))
</pre>



<pre class="src src-fundamental">ZREM ZREMRANGEBYRANK PUNSUBSCRIBE BRPOP BITCOUNT SET PEXPIREAT FLUSHDB
BGSAVE ZRANGE SLOWLOG SCARD HDEL HSETNX STRLEN CONFIG SET HEXISTS
SMOVE SUNIONSTORE ZINCRBY CONFIG RESETSTAT LINSERT BRPOPLPUSH ECHO
PSETEX LPOP SMEMBERS LPUSH ZRANK LINDEX RPOPLPUSH DECRBY
ZREVRANGEBYSCORE BLPOP ZADD SREM GETRANGE RENAMENX AUTH HINCRBYFLOAT
SINTER SDIFFSTORE LLEN MGET SUBSCRIBE ZCARD SETBIT MIGRATE INCRBY DEL
GETSET SETNX DEBUG OBJECT TTL RPUSH ZUNIONSTORE RPUSHX HLEN TIME LREM
INFO SLAVEOF HGET RESTORE LTRIM SADD BITOP WATCH PUBLISH PEXPIRE QUIT
SCRIPT FLUSH DECR EVALSHA HMGET LRANGE EXEC SCRIPT EXISTS INCRBYFLOAT
UNSUBSCRIBE BGREWRITEAOF MOVE PING EXPIREAT SRANDMEMBER LPUSHX HGETALL
LASTSAVE SCRIPT KILL HINCRBY CLIENT KILL CLIENT LIST INCR ZREVRANGE
PERSIST KEYS DUMP SETEX ZCOUNT MSET ZREVRANK LSET UNWATCH SHUTDOWN GET
SISMEMBER GETBIT CONFIG GET SINTERSTORE ZRANGEBYSCORE ZSCORE SDIFF
MULTI MONITOR HVALS DEBUG SEGFAULT PSUBSCRIBE HSET APPEND TYPE
SETRANGE SYNC SCRIPT LOAD EXISTS EVAL SELECT SUNION HKEYS RANDOMKEY
PTTL FLUSHALL HMSET SAVE DISCARD SPOP SORT ZREMRANGEBYSCORE RENAME
RPOP EXPIRE ZINTERSTORE MSETNX DBSIZE OBJECT
</pre>

</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> There are 144 commands in Redis 2.6.4</h4>
<div class="outline-text-4" id="text-1-5-2">




<pre class="src src-clojure">user&gt; (<span style="color: #a0522d;">count</span> (fetch-redis-commands))
<span style="color: #b22222;">;</span><span style="color: #b22222;">-&gt; 144</span>
</pre>

</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> There are only a handful of ideas behind all of them</h4>
<div class="outline-text-4" id="text-1-5-3">




<pre class="src src-javascript"><span style="color: #8b2252;">"BITOP"</span>: {
    <span style="color: #8b2252;">"summary"</span>: <span style="color: #8b2252;">"Perform bitwise operations between strings"</span>,
    <span style="color: #8b2252;">"complexity"</span>: <span style="color: #8b2252;">"O(N)"</span>,
    <span style="color: #8b2252;">"arguments"</span>: [
        {
            <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"operation"</span>,
            <span style="color: #8b2252;">"type"</span>: <span style="color: #8b2252;">"string"</span>
        },
        {
            <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"destkey"</span>,
            <span style="color: #8b2252;">"type"</span>: <span style="color: #8b2252;">"key"</span>
        },
        {
            <span style="color: #8b2252;">"name"</span>: <span style="color: #8b2252;">"key"</span>,
            <span style="color: #8b2252;">"type"</span>: <span style="color: #8b2252;">"key"</span>,
            <span style="color: #8b2252;">"multiple"</span>: <span style="color: #008b8b;">true</span>
        }
    ],
    <span style="color: #8b2252;">"since"</span>: <span style="color: #8b2252;">"2.6.0"</span>,
    <span style="color: #8b2252;">"group"</span>: <span style="color: #8b2252;">"string"</span>
},
</pre>

</div>

</div>

<div id="outline-container-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> Do we write and maintain 144 functions?</h4>
<div class="outline-text-4" id="text-1-5-4">

<ul>
<li id="sec-1-5-4-1">Hell no, we abstract!<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-5" class="outline-4">
<h4 id="sec-1-5-5"><span class="section-number-4">1.5.5</span> An introduction to macros in Clojure</h4>
<div class="outline-text-4" id="text-1-5-5">

<ul>
<li id="sec-1-5-5-1">The first rule of macro club<br/>



<pre class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">source http://clojuredocs.org/clojure_core/clojure.core/defmacro</span>
(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">unless</span> [pred a b]
  `(<span style="color: #483d8b;">if</span> (<span style="color: #a0522d;">not</span> ~pred) ~a ~b))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">usage:</span>

(unless false (<span style="color: #a0522d;">println</span> <span style="color: #8b2252;">"Will print"</span>) (<span style="color: #a0522d;">println</span> <span style="color: #8b2252;">"Will not print"</span>))
</pre>



<pre class="src src-clojure">user&gt; (<span style="color: #a0522d;">macroexpand-1</span> '(unless false (<span style="color: #a0522d;">println</span> <span style="color: #8b2252;">"Will print"</span>) (<span style="color: #a0522d;">println</span> <span style="color: #8b2252;">"Will not print"</span>)))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(if (clojure.core/not false)</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(println "Will print")</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(println "Will not print"))</span>
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-1-5-6" class="outline-4">
<h4 id="sec-1-5-6"><span class="section-number-4">1.5.6</span> Defining a language for describing command functions</h4>
<div class="outline-text-4" id="text-1-5-6">




<pre class="src src-clojure">(<span style="color: #a020f0;">defcommands</span>
  (<span style="color: #a0522d;">set</span>  [key value])
  (<span style="color: #a0522d;">get</span>  [key])
  (incr [key])
  (del  [key &amp; keys]))
</pre>

</div>

</div>

<div id="outline-container-1-5-7" class="outline-4">
<h4 id="sec-1-5-7"><span class="section-number-4">1.5.7</span> Writing the macros that pull it all together</h4>
<div class="outline-text-4" id="text-1-5-7">




<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">parameters</span>
  [params]
  (<span style="color: #483d8b;">let</span> [[args varargs] (<span style="color: #a0522d;">split-with</span> #(<span style="color: #a0522d;">not=</span> '&amp; %)  params)]
    (<span style="color: #a0522d;">conj</span> (<span style="color: #a0522d;">vec</span> args) (<span style="color: #a0522d;">last</span> varargs))))

(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defcommand</span>
  [name params]
  (<span style="color: #483d8b;">let</span> [com (<span style="color: #a0522d;">str</span> name)
        p (parameters params)]
    `(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">~name</span> ~params
       (<span style="color: #a0522d;">apply</span> command ~com ~@p))))
</pre>



<pre class="src src-clojure">user&gt; (<span style="color: #a0522d;">macroexpand-1</span> '(<span style="color: #a020f0;">defcommand</span> <span style="color: #0000ff;">set</span> [key value]))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(clojure.core/defn set</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">[key value]</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(clojure.core/apply</span>
<span style="color: #b22222;">;;    </span><span style="color: #b22222;">yow.core/command "set" key value nil))</span>

user&gt; (<span style="color: #a0522d;">macroexpand-1</span> '(<span style="color: #a020f0;">defcommand</span> <span style="color: #0000ff;">del</span> [key &amp; keys]))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(clojure.core/defn del</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">[key &amp; keys]</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(clojure.core/apply</span>
<span style="color: #b22222;">;;    </span><span style="color: #b22222;">yow.core/command "del" key keys))</span>
</pre>



<pre class="src src-clojure">(<span style="color: #a020f0;">defmacro</span> <span style="color: #0000ff;">defqueries</span>
  [&amp; queries]
  `(<span style="color: #483d8b;">do</span> ~@(<span style="color: #a0522d;">map</span> (<span style="color: #a020f0;">fn</span> [q] `(<span style="color: #a020f0;">defquery</span> <span style="color: #0000ff;">~@q</span>)) queries)))

user&gt; (<span style="color: #a0522d;">macroexpand-1</span>
       '(<span style="color: #a020f0;">defcommands</span> (<span style="color: #a0522d;">set</span> [set value]) (del [key &amp; keys])))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(do</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(yow.core/defcommand set [set value])</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(yow.core/defcommand del [key &amp; keys]))</span>
user&gt; (clojure.walk/<span style="color: #228b22;">macroexpand-all</span>
       '(<span style="color: #a020f0;">defcommands</span> (<span style="color: #a0522d;">set</span> [set value]) (del [key &amp; keys])))
<span style="color: #b22222;">;; </span><span style="color: #b22222;">(do</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(def set</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(fn* ([set value]</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">(clojure.core/apply yow.core/command "set" set value nil))))</span>
<span style="color: #b22222;">;;   </span><span style="color: #b22222;">(def del</span>
<span style="color: #b22222;">;;     </span><span style="color: #b22222;">(fn* ([key &amp; keys]</span>
<span style="color: #b22222;">;;             </span><span style="color: #b22222;">(clojure.core/apply yow.core/command "del" key keys)))))</span>
</pre>

</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Keeping track of the commands</h3>
<div class="outline-text-3" id="text-1-6">


</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> How do we keep track of everything?</h4>
<div class="outline-text-4" id="text-1-6-1">

</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Programatically extracting all of the commands</h4>
<div class="outline-text-4" id="text-1-6-2">

<ul>
<li id="sec-1-6-2-1"><a href="https://raw.github.com/antirez/redis-doc/master/commands.json">https://raw.github.com/antirez/redis-doc/master/commands.json</a><br/>

</li>
</ul>
</div>

</div>
